# 1. Создать класс TrafficLight (светофор).
# определить у него один атрибут color (цвет) и метод running (запуск);
# атрибут реализовать как приватный;
# в рамках метода реализовать переключение светофора в режимы: красный, жёлтый, зелёный;
# продолжительность первого состояния (красный) составляет 7 секунд, второго (жёлтый) — 2 секунды, третьего (зелёный) — на ваше усмотрение;
# переключение между режимами должно осуществляться только в указанном порядке (красный, жёлтый, зелёный);
# проверить работу примера, создав экземпляр и вызвав описанный метод.
# Задачу можно усложнить, реализовав проверку порядка режимов. При его нарушении выводить соответствующее сообщение и завершать скрипт.

import itertools
import time
class TrafficLight:
    def __init__(self):
        self.__color = ['Красный','Желтый','Зеленый']
        self.sec = [7,2,5]
    def running(self):
        for color, sec in itertools.zip_longest(self.__color,self.sec):
            print(color)
            time.sleep(sec)
start = TrafficLight()
start.running()
start.running()





